Revit 2027 API
BuiltInFailures.GridFailures.GridInGridChainCannotMirror Property
 A grid that is a sub-grid of a multi-segment grid can only be mirrored if the entire multi-segment grid is being mirrored.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GridInGridChainCannotMirror { get; }
Public Shared ReadOnly Property GridInGridChainCannotMirror As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GridInGridChainCannotMirror {
	FailureDefinitionId^ get ();
}
static member GridInGridChainCannotMirror : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GridFailures Class
Autodesk.Revit.DB Namespace